; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 171256 2 3 4 7 2
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	infrared0 - mode
	infrared2 - mode
	spectrograph1 - mode
	image3 - mode
	Star3 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	Star0 - direction
	Star1 - direction
	Star2 - direction
	Star4 - direction
	Planet7 - direction
	Star8 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 spectrograph1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star2)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 Star0)
	(supports instrument2 infrared2)
	(supports instrument2 image3)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 Star2)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet7)
)
(:goal (and
	(pointing satellite0 GroundStation5)
	(have_image Planet7 infrared2)
	(have_image Star8 infrared0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 3
2. (turn_to satellite0 star8 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star8)
   goals met: 0 of 3
3. (turn_to satellite0 star2 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star2)
   goals met: 0 of 3
4. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 3
5. (turn_to satellite0 star8 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star8)
   goals met: 0 of 3
6. (take_image satellite0 star8 instrument0 infrared0)
   added: (have_image star8 infrared0)
   goals met: 1 of 3
7. (turn_to satellite0 planet7 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 planet7)
   goals met: 1 of 3
8. (take_image satellite0 planet7 instrument0 infrared2)
   added: (have_image planet7 infrared2)
   goals met: 2 of 3
9. (turn_to satellite0 groundstation5 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 groundstation5)
   goals met: 3 of 3
